

//平台用户协议
export const getPrivacy = (name: string) => {
    return [
        {
            text: `${name}用户协议`,
            className: 'name',
        },
        {
            text: `欢迎您在${name}（以下简称“本平台”）注册。您在本平台注册后，便成为本平台用户，可使用本平台提供的服务。`,
        },
        {
            text: `在您注册成为本平台用户之前，请确认您已仔细阅读、充分理解并接受本协议的全部条款。一旦您使用本平台服务，即视为您同意遵循本协议条款中的各项内容。本平台有权随时对协议条款进行修改。一旦协议条款发生变更和修改，将在相关页面上提示修改的内容。如果您不同意本协议的修改，可以取消已经获取的服务并停止使用；如果您继续使用本平台提供的服务，则视为您已经接受本协议的修改。`,
        },
        {
            text: '一、协议适用主体范围',
            className: 'title',
        },
        {
            text: `本协议是您和本平台明确双方通过本平台使用相关产品/服务过程中的权利义务所订立的协议。订立本协议的用户，应当是具备完全民事权利能力和完全民事行为能力的自然人。如若不符请不要使用。否则将导致无效或被撤销等，并由您承担全部责任和后果。`,
        },
        {
            text: '二、平台服务内容',
            className: 'title',
        },
        {
            text: `本平台为用户提供职业技能培训相关产品/服务，产品/服务的具体内容由本平台根据实际情况提供。本平台遵循相关的法律法规，保留随时变更、中断或终止部分或全部服务的权利。`,
        },
        {
            text: `您理解并同意，本平台提供的产品/服务是按照现有技术和条件所能达到的现状提供的。本平台会尽最大努力向您提供服务，确保服务的连贯性和安全性。您理解，本平台不能随时预见和防范技术以及其他风险，包括但不限于不可抗因素、网络原因、第三方服务瑕疵等原因导致的服务中断、不能正常使用相关服务以及其他的风险和损失。`,
        },
        {
            text: '三、注册信息提供及账号管理',
            className: 'title',
        },
        {
            text: `本平台为您提供了注册通道。您在注册账号时，应当按照注册页面引导提供真实、准确、完整、最新的个人资料，并使用本人有效身份信息、手机号码等个人信息进行实名验证。您在阅读并同意本协议并且完成全部注册程序后，即可获得本平台账号并成为本平台用户。您注册的账号所有权归属于本平台。若账号被注销或服务被终止，本平台可以永久地删除该账号所属的全部信息或数据，本平台没有义务向户返还或恢复任何信息或数据。您注册、使用和管理本平台账号时，应遵守以下规则：`,
        },
        {
            text: `（一）您理解并承诺，您所设置的账号不得违反国家法律法规及本平台的相关规则，您提供的注册信息及其他个人信息中不得出现违法和不良信息，未经他人许可不得使用他人名义（包括但不限于冒用他人姓名等足以让人引起混淆的方式）开设账号，不得恶意注册本平台账号（包括但不限于频繁注册、批量注册账号等行为）。您在账号注册及使用过程中需遵守相关法律法规，不得实施任何侵害国家利益、损害其他公民合法权益、有害社会道德风尚、违背公序良俗的行为。本平台有权对您提交的信息进行审核。`,
        },
        {
            text: `（二）在注册、使用和管理账号时，您应保证注册账号时填写的身份信息的真实性，请您在注册、管理账号时使用真实、准确、合法、有效的相关身份证明材料及必要信息。依照国家相关法律法规的规定，为使用本平台的部分功能，您需要填写真实的身份信息，请您按照相关法律规定完成实名认证，并注意及时更新上述相关信息。若您提交的材料或提供的信息不准确、不真实、不合法或本平台有理由怀疑为错误、不实或不合法的资料，则本平台有权拒绝为您提供相关功能，您可能无法使用本平台或在使用过程中部分功能受到限制。`,
        },
        {
            text: `（三）您的账号仅限于您本人使用，禁止以任何形式赠予、借用、出租、转让、售卖或以其他方式许可他人使用该账号。如果本平台发现或有合理理由认为使用者并非账号初始注册人，为保障账号安全，本平台有权立即暂停或终止向该注册账号提供服务，或永久注销该账号。`,
        },
        {
            text: `（四）您有责任维护个人账号、密码的安全性与保密性，并对您以注册账号名义所从事的活动承担全部法律责任，包括但不限于您在本平台进行的任何数据修改等操作行为可能引起的一切法律责任。您应高度重视对账号与密码的保密，在任何情况下都不得向他人透露账号及密码。若发现他人未经许可使用您的账号或发生其他安全漏洞问题时，您应当立即通知本平台。`,
        },
        {
            text: `（五）在丢失账号或遗忘密码时，您可遵照本平台提供的申诉途径及时申诉请求找回账号或密码。您理解并认可，本平台的密码找回机制仅需要识别申诉单上所填资料与系统记录资料具有一致性，而无法识别申诉人是否系真正账号有权使用者。本平台特别提醒您应妥善保管您的账号和密码，如因您保管不当等自身原因或其他非本平台因素导致遭受盗号或密码丢失，您将自行承担相应责任。`,
        },
        {
            text: `（六）当您完成本平台的账号注册、登录并进行合理和必要的身份验证后，您可随时浏览、修改自己提交的个人信息。您理解并同意，出于安全性和身份识别（如账号或密码找回申诉服务等）的考虑，您可能无法修改您实名认证时提供的个人身份信息及其他验证信息。您也可以申请注销账号，本平台会在完成个人身份、安全状态、设备信息等合理和必要的验证后协助您注销账号，并依照您的要求删除有关您账号的一切信息，法律法规另有规定的除外。`,
        },
        {
            text: '四、用户行为规范',
            className: 'title',
        },
        {
            text: `您应当对您使用本平台的行为负责，除非法律允许或经本平台事先书面许可，您不得实施下列行为：`,
        },
        {
            text: `（一）使用未经本平台授权或许可的任何插件、外挂、系统或第三方工具对本平台的正常运行进行干扰、破坏、修改或施加其他影响。`,
        },
        {
            text: `（二）利用或针对本平台进行任何危害计算机网络安全的行为，包括但不限于：`,
        },

        {
            text: `1.非法进入他人网络、干扰他人网络正常功能、窃取网络数据等危害网络安全的活动；`,
        },
        {
            text: `2.提供专门用于从事侵入网络、干扰网络正常功能及保护措施、窃取网络数据等危害网络安全活动的程序、工具；`,
        },
        {
            text: `3.明知他人从事危害网络安全的活动仍为其提供技术支持、广告推广、支付结算等帮助；`,
        },
        {
            text: `4.使用未经许可的数据或进入未经许可的服务器；`,
        },
        {
            text: `5.未经许可进入公众计算机网络或他人计算机网络系统并删除、修改、增加储存信息；`,
        },
        {
            text: `6.未经许可，企图探查、扫描、测试本平台系统或网络的弱点或其他实施破坏网络安全的行为；`,
        },
        {
            text: `7.企图干涉、破坏本平台的正常运行，故意传播恶意程序或病毒以及其他干扰正常网络信息服务的行为；`,
        },
        {
            text: `8.伪造TCP/IP数据包名称或部分名称；`,
        },
        {
            text: `9.对本平台进行逆向工程、反向汇编、编译或者以其他方式尝试发现本平台的源代码；`,
        },
        {
            text: `10.恶意注册本平台账号，包括但不限于频繁注册、批量注册账号等；`,
        },
        {
            text: `11.未经允许，进入本平台或者使用本平台资源（包括但不限于以任何机器人软件、蜘蛛软件、爬虫软件、刷屏软件或其它自动方式访问或登录本平台）；`,
        },
        {
            text: `12.违反法律法规、本协议、本平台的相关规则及侵犯他人合法权益的其他行为。`,
        },
        {
            text: `13.其他危害网络或本平台安全的行为。`,
        },

        {
            text: `（三）发布、转载、传送含有下列内容之一的信息：`,
        },
        {
            text: `1.反对宪法所确定的基本原则的；`,
        },
        {
            text: `2.危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；`,
        },
        {
            text: `3.损害国家荣誉和利益的；`,
        },
        {
            text: `4.煽动民族仇恨、民族歧视，破坏民族团结的；`,
        },
        {
            text: `5.破坏国家宗教政策，宣扬邪教和封建迷信的；`,
        },
        {
            text: `6.散布谣言，扰乱社会秩序，破坏社会稳定的；`,
        },
        {
            text: `7.散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；`,
        },
        {
            text: `8.侮辱或者诽谤他人，侵害他人合法权益的；`,
        },
        {
            text: `9.侵犯任何第三者的知识产权，版权或公众/私人权利的；`,
        },
        {
            text: `10.其他法律、行政法规禁止的行为或内容的。`,
        },
        {
            text: `如果本平台认为您的任何行为违反或可能违反上述约定的，本平台可独立进行判断并处理，且有权在不进行任何事先通知的情况下终止向您提供服务，并保留追究您相关法律责任的权利。`,
        },
        {
            text: `您可通过拨打投诉电话向本平台投诉、举报各类违法传播活动、违法有害信息等内容，本平台将及时受理和处理您的投诉举报，以共同营造风清气正的网络环境。`,
        },
        {
            text: `五、用户承诺和授权`,
            className: 'title',
        },
        {
            text: `（一）遵守中国法律法规，遵守所有与网络服务有关的协议、规定和程序，不从事任何非法的行为。`,
        },
        {
            text: `（二）用户应当对其所提供信息的真实性、准确性、合法性负责，不得出现违法违规和不实信息。`,
        },
        {
            text: `（三）用户负有对其本平台账户的用户名和密码的保密义务，对操作使用其本平台账户的所有行为暨该账户下发生的所有活动及事件承担全部责任。`,
        },
        {
            text: `（四）用户同意接收本平台推送的信息。`,
        },
        {
            text: `（五）本平台提供的服务信息可能包括文字、软件、声音、图片、视频、图表、数据等。所有这些信息受著作、商标、专利等知识产权和其他财产所有权法律的保护，用户只有在获得本平台或其他相关权利人的授权许可之后才能使用这些信息。`,
        },
        {
            text: `六、隐私保护`,
            className: 'title',
        },
        {
            text: `隐私保护的内容详见本平台的《${name}用户隐私政策》。`,
        },
        {
            text: `七、免责声明`,
            className: 'title',
        },
        {
            text: `（一）本平台仅负责按“现状”和“可得到”的状态向用户提供服务，但不作任何明示或暗示的保证；不担保本平台上的信息和服务能充分满足用户的需求；不保证任何信息和服务的准确性、完整性、适用性、及时性和合法可靠性等。`,
        },
        {
            text: `（二）对于因不可抗力、系统故障或维护、通讯或网络故障、病毒或恶意攻击、第三方行为等或本平台不能控制的原因造成服务中断等影响或后果，本平台不承担任何责任，请注意及时备份相关资料。`,
        },
        {
            text: `（三）服务终止或取消后，本平台没有义务向用户返还或恢复任何信息或数据。`,
        },
        {
            text: `（四）所有联系、通知或送达，本平台将通过正式的页面通知公告、平台私信、电子邮件、客服电话、联系手机或常规的信件等任何一种或几种方式进行。本平台不承担因用户未提供或未及时、准确提供联系方式而未收到通告或无法送达导致的任何后果。`,
        },
        {
            text: `（五）用户因使用本平台过程中的行为导致本平台或任何其他第三方产生损失的，用户应当承担全部责任及合理维权费用。`,
        },
        {
            text: `八、违约处理`,
            className: 'title',
        },
        {
            text: `（一）发生如下情形之一的，视为用户违约：`,
        },
        {
            text: `1.使用本平台服务时违反有关法律法规的规定的。`,
        },
        {
            text: `2.违反本协议或本协议补充协议约定（含违反声明、承诺或保证）的。`,
        },
        {
            text: `3.违反本平台规章制度、相关政策的。`,
        },
        {
            text: `（二）违约处理措施`,
        },
        {
            text: `1.用户违约（含违反声明、承诺或保证，以及用户因使用本平台过程中的行为导致本平台或任何其他第三方产生损失等），应自行承担因此产生的一切法律后果。同时，本平台有权直接采取一切必要的措施，包括但不限于删除用户发布的内容，完全或部分中止、限制账号暨服务的使用，乃至通过诉讼等形式追究用户包括赔偿损失在内的法律责任等。赔偿范围包括但不限于罚款、赔偿金以及本平台支付的相应诉讼仲裁费、律师费、公证费、鉴定费、调查费、差旅费等全部费用。`,
        },
        {
            text: `2.本平台还可将用户的违约行为和对用户违约行为处理措施信息以及相关司法行政机关、监管机构的生效法律文书等信息在本平台上予以公示。`,
        },
        {
            text: `九、其它`,
            className: 'title',
        },
        {
            text: `（一）您知悉并授权本平台在必需的情况下使用或与关联单位同步您的信息，为您提供征信及其他相关服务。`,
        },
        {
            text: `（二）本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。`,
        },
        {
            text: `（三）如双方就本协议内容或执行发生任何争议，双方应协商解决；协商不成时，凡因本协议引起的或与本协议有关的一切争议,均提请杭州仲裁委员会按照其仲裁规则进行仲裁。`,
        },
        {
            text: `（四）所有本平台已经发布或将来可能发布的各类规章制度、政策、本协议之补充协议、本协议之附件等为本协议不可分割的组成部分，且与本协议具有同等法律效力。`,
        },
    ]
}

//隐私协议
export const privacyPolicy = (name: string) => {
    return [
        {
            text: `${name}隐私政策`,
            className: 'name',
        },
        {
            text: `更新日期：2023年8月8日`,
        },
        {
            text: `生效日期：2023年9月8日`,
        },
        {
            text: `《${name}隐私政策》（以下简称“本政策”）仅适用于${name}（以下简称“平台”）相关产品与/或服务。您在使用本产品前，请仔细阅读本政策，以了解我们处理您个人信息的详情。`,
        },
        {
            text: `特别说明：`,
            className: 'title',
        },
        {
            text: `一、本政策适用对象为访问、注册、登录及使用平台产品与/或服务的访问者和开发者，以及使用调用了平台API/SDK产品与/或服务的最终用户。`,
        },
        {
            text: `二、如开发者将平台提供的产品与/或服务集成到其自行开发的产品与/或服务中并向最终用户提供，或以任何其他形式使用平台产品与/或服务并向最终用户提供，则开发者应承诺：`,
        },
        {
            text: `（一）处理最终用户个人信息的过程中，遵守可适用的法律法规和国家规范性文件，包括但不限于《中华人民共和国网络安全法》《中华人民共和国数据安全法》《中华人民共和国个人信息保护法》《GB/T35273-2020信息安全技术个人信息安全规范》等。`,
        },
        {
            text: `（二）向最终用户告知自身的产品与/或服务中使用了平台提供的产品与/或服务，且最终用户的个人信息会共享至平台，包括告知共享的目的、共享方式和共享的个人信息种类。同时，开发者可以在使用平台产品与/或服务的隐私政策中提供一个链接，使其指向本政策。`,
        },
        {
            text: `（三）获得最终用户充分、必要且明确的授权、同意和许可，允许我们在符合相关法律法规的前提下可将收集、处理的信息用于本政策列明的服务用途。`,
        },
        {
            text: `（四）已向最终用户提供易于操作的用户权利实现机制，包括告知最终用户如何行使知情、查阅、复制、更正、删除、补充、转移等可适用法律法规要求的各项权利。`,
        },
        {
            text: `三、本政策阐述了我们如何处理个人信息的详情，但不覆盖调用了平台产品与/或服务的第三方产品与服务处理个人信息的全部场景。虽然第三方调用了我们的产品与/或服务，但我们并不了解或控制其具体的使用行为，因此也不为其行为负责；如您是使用调用了平台产品与/或服务的最终用户，我们建议您在已查看并同意其隐私政策之前，谨慎访问或使用其产品与服务。`,
        },
        {
            text: `一、定义与解释`,
            className: 'title',
        },
        {
            text: `（一）平台产品与/或服务`,
            className: 'header',
        },
        {
            text: `包括${name}网站，及相关服务解决方案。`,
        },
        {
            text: `（二）用户`,
            className: 'header',
        },
        {
            text: `是指访问平台网站，注册、登录以及使用平台产品与/或服务，并通过启用、浏览或上传数据至平台的访问者和开发者，以及使用调用了平台人工智能API/SDK产品与/或服务的最终用户。在本政策中更多地称为“您”。`,
        },
        {
            text: `（三）账号`,
            className: 'header',
        },
        {
            text: `指您完成真实信息注册后，享有的用户账号，该用户账号由您负责保管；您应当对以您账号下进行的所有行为负法律责任。`,
        },
        {
            text: `（四）个人信息`,
            className: 'header',
        },
        {
            text: `个人信息是以电子或者其他方式记录的与已识别或者可识别的自然人有关的各种信息，不包括匿名化处理后的信息。为免异义，个人信息包括但不限于敏感个人信息。`,
        },
        {
            text: `（五）敏感个人信息`,
            className: 'header',
        },
        {
            text: `敏感个人信息是一旦泄露或者非法使用，容易导致自然人的人格尊严受到侵害或者人身、财产安全受到危害的个人信息，包括生物识别、宗教信仰、特定身份、医疗健康、金融账号、行踪轨迹等信息，以及不满十四周岁未成年人的个人信息。`,
        },
        {
            text: `（六）个人信息的处理`,
            className: 'header',
        },
        {
            text: `个人信息的处理包括个人信息的收集、存储、使用、加工、传输、提供、公开、删除等。`,
        },
        {
            text: `（七）个人信息处理者`,
            className: 'header',
        },
        {
            text: `个人信息处理者是指在个人信息处理活动中自主决定处理目的、处理方式的组织、个人。`,
        },
        {
            text: `（八）个人信息主体`,
            className: 'header',
        },
        {
            text: `个人信息主体指个人信息所标识或者关联的自然人。`,
        },
        {
            text: `（九）去标识化`,
            className: 'header',
        },
        {
            text: `去标识化指个人信息经过处理，使其在不借助额外信息的情况下，无法识别特定自然人的过程。`,
        },
        {
            text: `（十）匿名化`,
            className: 'header',
        },
        {
            text: `匿名化指个人信息经过处理无法识别特定自然人且不能复原的过程。`,
        },
        {
            text: `（十一）设备`,
            className: 'header',
        },
        {
            text: `设备是指可用于访问${name}服务的装置，例如台式计算机、笔记本电脑、平板电脑或智能手机。`,
        },
        {
            text: `（十二）IP地址`,
            className: 'header',
        },
        {
            text: `每台上网的设备都会指定一个编号，称为互联网协议(IP)地址。这些编号通常都是根据地理区域指定的。IP地址通常可用于识别设备连接至互联网时所在的位置。`,
        },
        {
            text: `（十三）SSL`,
            className: 'header',
        },
        {
            text: `SSL（SecureSocketLayer）又称为安全套接层，是在传输通信协议（TCP/IP）上实现的一种安全协议。SSL支持各种类型的网络，同时提供三种基本的安全服务，均通过使用公开密钥和对称密钥技术以达到信息保密的效果。`,
        },
        {
            text: `（十四）信息收集技术`,
            className: 'header',
        },
        {
            text: `平台在本政策中所述的“自动收集”包括以下方式：`,
        },
        {
            text: `1.Cookie：Cookie是您浏览网页时，网站服务器放在客户端（您的计算机、移动电话或其他智能终端内）里面的一个小小的文本文件，可用于改善您的使用体验。`,
        },
        {
            text: `2.Web：beacon（网络信标）Webbeacon是装嵌在网站或电邮内的电子图像文件或其他技术，可用于计算访客数目、记录您是否及何时阅览电邮或网站，或用以使用某些Cookie。`,
        },
        {
            text: `3.Logfiles（日志文件）：Logfiles储存自动收集的若干数据。该等数据包括互联网协议（IP）地址、浏览器类型、互联网服务提供商（ISP）、引用/退出页面、操作系统、日期/时间戳和点击流数据等。`,
        },
        {
            text: `4.ETTag（实体标签）：ETTag是在互联网浏览器与互联网服务器之间背后传送的HTTP协议标头，可代替Cookie，用以追踪个别使用者，使我们可更深入地了解和改善我们的服务。`,
        },
        {
            text: `5.JavaScript：JavaScript是一种编程语言，用于制作更具互动性和动态的网页。JavaScript可以设定Cookie、阅读Cookie及删除Cookie。`,
        },
        {
            text: `二、我们如何收集和使用您的个人信息`,
            className: 'title',
        },
        {
            text: `平台通过互联网方式向您提供产品能力服务与解决方案，您可以通过平台获取、购买平台产品或服务。平台作为个人信息的处理者，会遵循合法、正当、必要、诚信的原则，仅将您主动提供的个人信息和我们主动收集的个人信息用于本政策所限定的收集个人信息的使用用途并与实现产品或服务的业务功能有直接关联，以为您提供开放平台优质的产品与/或服务，以及用于身份验证、安全防范、反诈骗监测、存档备份、客户的安全服务用途以提高产品和服务的安全性。具体地，我们将出于如下所述的目的收集和使用您的个人信息。`,
        },
        {
            text: `（一）向您提供产品与/或服务过程中您主动提供的个人信息`,
            className: 'header',
        },
        {
            text: `1.当您是访问、注册、登录及使用平台产品与/或服务的访问者和开发者时：`,
        },
        {
            text: `（1）为实现我们的基本业务功能，您仅需要向我们提供该功能所对应的基本必要的个人信息，相关法律法规和规范性文件有特殊要求的除外。若您拒绝提供，我们将无法向您提供相应的服务。提示您注意：如果您提供的是非本人的个人信息，请您确保已取得相关主体的同意。`,
        },
        {
            text: `1）账号注册/登录及使用`,
        },
        {
            text: `如果您选择使用平台的功能，为便于使用我们为您提供的完整的开放平台产品与/或服务，您需要注册一个平台账号。在您使用手机号注册或登录平台账号时，您需要提供手机号码并设置登录密码，并且通过输入短信验证码，以便我们对您的用户身份进行核验，以保护您的账号不被未经授权的第三方进入。如果您仅需使用输入、查看、搜索等访问相关服务，您不需要注册平台账号及提供上述个人信息。`,
        },
        {
            text: `2）实名认证`,
        },
        {
            text: `当您使用平台提供的部分产品与/或服务时，根据相关法律法规要求，需要您进行实名认证。实名认证需要上传实名认证信息。不同的实名认证主体类型会要求不同实名认证信息，这些信息包括：姓名、证件号码、公司名称、公司统一信用代码、公司注册地址、组织机构信息、身份证信息。上述信息将仅在您使用平台提供的产品与/或服务期间持续授权平台保存使用。在您主动注销账号时，我们将根据适用法律法规的要求尽快使其匿名或删除您的个人信息。`,
        },
        {
            text: `（2）为了向您提供更优质的平台产品与服务，我们可能需要收集下述信息。如果您拒绝提供下述信息，不影响您正常使用基本业务功能，但您可能无法获得这些扩展业务功能给您带来的用户体验。`,
        },
        {
            text: `1）订单生成`,
        },
        {
            text: `当您选择购买我们的产品与/或服务时，系统会生成购买该产品服务的订单，您至少需要填写收货人姓名、联系电话。同时该订单会载明订单号、您购买的产品服务内容、应支付的金额以及支付方式。上述所有信息将构成您的“订单信息”。我们将通过订单为您提供相应的订单查询、支付结算、完成配送、提供客服咨询与售后服务。`,
        },
        {
            text: `2）支付`,
        },
        {
            text: `在您下单后，您可以选择通过银行向平台汇款转账支付订单，您至少需要向我们提供汇款银行名称、汇款账号、汇款账户名、汇款金额、汇款时间，用于交易金额与银行汇款记录间的核对，以实现其确认您的支付指令并完成支付。您还可以通过微信支付、支付宝支付所提供的第三方支付服务。支付功能本身并不收集您的个人信息，但我们需要将您的订单号与交易金额信息与这些支付机构共享以实现其确认您的支付指令并完成支付。`,
        },
        {
            text: `3）活动参与和服务改进`,
        },
        {
            text: `当您通过我们的客服或参加平台举办的活动时，我们会收集您自愿参与填写的信息。如您参与平台线上活动时填写的调查问卷中可能包含您的姓名、电话、电子邮箱、家庭地址信息。并且，当您在平台注册、登录或后续使用过程中，您可以进入平台的账号信息页面自愿选择填写昵称、性别、生日和所在地信息。我们可能会利用前述信息向您进行活动反馈，或进行用户和市场调研分析（如判断您的大致用户属性），以提升、改进我们的产品设计，为您提供个性化发送和更优的服务体验。但如果您不提供这些个人信息，并不会影响您正常使用平台的所有基本功能和服务。`,
        },
        {
            text: `（二）向您提供产品与/或服务过程中我们主动收集的个人信息`,
            className: 'header',
        },
        {
            text: `在符合法律法规前提下，为了保障您的账号安全和更好地为您提供优质的服务，我们会收集和使用您在使用平台产品与/或服务中产生的如下信息：`,
        },
        {
            text: `1.当您是访问、注册、登录及使用平台产品与/或服务的访问者和开发者时：`,
        },
        {
            text: `（1）系统日志`,
        },
        {
            text: `当您使用平台的产品与/或服务时，系统可能会通过Cookies或其他方式自动收集某些信息作为系统日志保存。收集此类信息的目的在于：通过数据统计改进和优化产品体验、保障服务稳定和网络安全。此类信息包含：您使用平台时的详细使用情况，包括您的产品服务使用记录、搜索查询内容、访问的页面地址、登录IP、浏览器的类型、网络状态、运营商、使用的语言、访问日期和时间、系统活动及您访问的网页记录。`,
        },
        {
            text: `（2）调用日志`,
        },
        {
            text: `在您使用调用了平台提供的人工智能API/SDK的应用或其他产品与/服务时，我们会收集您的设备调用我们API/SDK的调用记录日志，以用于调用数量的统计分析。`,
        },
        {
            text: `（3）数据处理说明`,
        },
        {
            text: `1）基于您向我们提供的信息、我们主动收集的信息，我们可能会基于其中一项或多项信息（如设备号、移动应用列表、系统日志）的结合进行自动化决策（构建画像），根据画像向您提供更契合你需求的页面展示、发送您可能感兴趣的个性化内容及我们或第三方的商业资讯和营销广告。我们也可能会通过您账号信息中预留的手机号码，通过电话、短信或其他方式向您拨打电话或发送营销短信。如您拒绝接收短信发送（包括营销短信），您可通过短信中提供的退订方式予以退订。同时，我们可能会与平台的关联公司或委托处理的合作方共享设备信息，这类合作伙伴可能将上述信息与他们合法获取的其他信息相结合，以帮助其在不识别您个人身份的前提下提升广告有效触达率，以便更好地向您提供我们或第三方的商业资讯和营销广告。如您拒绝接收前述信息，您可以通过本政策第九条所述的联系方式向我们进行反馈。`,
        },
        {
            text: `2）我们使用收集到的信息保障我们及关联方、合作方的业务运营，例如评估、维护和改进产品和服务的性能：当我们的系统发生故障时，我们会记录和分析系统故障时产生的信息，优化平台的相关服务。为迭代和开发新的产品和服务，我们可能对收集的信息加以统计分析辅助决策，但形成的数据分析结果不包含您的任何身份识别信息。例如平台在提供某些功能或服务中邀请您参与“用户体验改进计划”，您自愿加入用户体验改进计划后，我们会根据需要对产品与服务的各项功能使用情况进行统计，这样可以通过分析统计数据提高产品或服务质量，推出对用户有帮助的创新产品或服务提升。如您不想参与该计划，可以选择关闭相关产品与/或服务中的相关功能。`,
        },
        {
            text: `3）根据适用的法律法规，我们可能会对您的个人信息进行技术处理，使得根据该信息无法精确识别到用户个人，并对技术处理后的信息进行匿名化或去标识化的学术研究或统计分析（包括使用匿名化或去标识化后的语音信息进行模型算法的训练），以更好地提升产品功能和服务能力。`,
        },
        {
            text: `4）当您是使用调用平台API/SDK的产品或服务的最终用户时，该产品或应用的运营者也可能自行通过其他方式收集和使用您的个人信息。请您知悉，我们的隐私政策不适用于该运营者为您提供的产品与/或服务，因此，我们强烈建议您仔细阅读他们的隐私政策。`,
        },
        {
            text: `三、我们如何委托处理、共享、转让、公开披露您的个人信息`,
            className: 'title',
        },
        {
            text: `（一）委托处理`,
            className: 'header',
        },
        {
            text: `为了向您提供更完善、更优质的产品和服务，我们可能会委托第三方（包括公司、组织和个人）处理您的某些个人信息。对我们委托处理您个人信息的第三方，我们会与其签署严格的数据处理协议，明确约定委托处理的目的、期限、处理方式、个人信息的种类、保护措施以及双方的权利和义务等，并对第三方的个人信息处理活动进行监督，要求第三方仅按照我们的要求、本政策的规定以及其他任何相关的保密和安全措施来处理您的个人信息，不得超出约定的处理目的、处理方式等处理个人信息。如果您拒绝我们的第三方在提供服务时收集为提供服务所必需的个人信息，将可能导致您在使用平台产品与/或服务的过程中无法享受该第三方提供的服务。`,
        },
        {
            text: `（二）共享`,
            className: 'header',
        },
        {
            text: `1.我们不会与第三方（包括公司、组织和个人）共享您的个人信息，但以下情况除外：`,
        },
        {
            text: `在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。`,
        },
        {
            text: `在法定情形下的共享：我们可能会根据法律法规规定、诉讼争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的个人信息。`,
        },
        {
            text: `与关联公司共享：为了与我们的其他产品或服务所关联，为您提供更好的服务，或保护平台关联公司或其他用户或公众的人身财产安全免遭侵害，您的信息可能会在平台的关联公司内共享。我们仅会出于特定、明确而合法的且在本政策所声明的目的范围内，在平台的关联公司之间共享您的个人信息，并且只会共享提供服务所必要的信息。例如：在注册账号时为了避免重复注册，我们需要对拟注册的账号进行全球唯一性校验。但是对于与关联公司共享的信息，我们会要求关联公司对您的信息采取不低于本政策声明的保护措施，并且严格遵守相关法律法规与监管要求。关联公司如要改变个人信息的处理目的，将需要再次征求您的授权同意。`,
        },
        {
            text: `与授权合作伙伴共享：仅为实现本政策中声明的目的，我们的某些服务将由我们和授权合作伙伴共同提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。目前，我们的授权合作伙伴包括以下类型：`,
        },
        {
            text: `供应商、服务提供商和其他合作伙伴。我们将信息发送给支持我们业务的供应商、服务提供商和其他合作伙伴，这些支持包括提供技术基础设施服务、分析我们服务的使用方式、衡量广告和服务的有效性、提供客户服务或进行学术研究和调查。`,
        },
        {
            text: `对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息，并且要求他们的处理行为不得违反中国个人信息保护和数据安全相关的法律法规、国家标准和其他规范性文件。原则上，我们与之共享个人信息的公司、组织和个人无权将我们共享的个人信息用于本政策之外的其他任何用途。`,
        },
        {
            text: `（三）转让`,
            className: 'header',
        },
        {
            text: `我们不会将您的个人信息转让给任何第三方（包括公司、组织和个人），但以下情况除外：`,
        },
        {
            text: `1.在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；`,
        },
        {
            text: `2.根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况下进行提供；`,
        },
        {
            text: `3.在本产品服务提供者发生合并、收购或破产清算情形，或其他涉及合并、收购或破产清算情形时，如涉及到个人信息转让，我们会告知您接收方的名称或者姓名和联系方式，并要求新的持有您个人信息的接收方继续受本政策的约束，对于接收方变更原先的处理目的、处理方式的，我们将要求该接收方重新向您征求授权同意。`,
        },
        {
            text: `（四）公开披露`,
            className: 'header',
        },
        {
            text: `我们仅会在以下情况公开披露您的个人信息：`,
        },
        {
            text: `（1）获得您单独同意或基于您的主动选择；`,
        },
        {
            text: `（2）法律、法律程序、诉讼或政府主管部门强制性要求；`,
        },
        {
            text: `（3）如果我们确定您出现违反法律法规或严重违反本产品相关协议规则的情况，或为保护本产品及其关联公司用户或公众的人身财产安全免遭侵害，我们可能依据法律法规或本产品相关协议规则披露关于您的个人信息，包括相关违规行为以及本产品已对您采取的措施。`,
        },
        {
            text: `（五）委托处理、共享、转让、披露个人信息时事先征得授权同意的例外`,
            className: 'header',
        },
        {
            text: `以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：`,
        },
        {
            text: `（1）与我们履行法律法规规定的义务相关的；`,
        },
        {
            text: `（2）与国家安全、国防安全有关的；`,
        },
        {
            text: `（3）与公共安全、公共卫生、重大公共利益有关的；`,
        },
        {
            text: `（4）与犯罪侦查、起诉、审判和判决执行等有关的；`,
        },
        {
            text: `（5）出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；`,
        },
        {
            text: `（6）您自行公开的个人信息；`,
        },
        {
            text: `（7）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。`,
        },
        {
            text: `请您知悉，根据法律规定，共享、转让经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。`,
        },
        {
            text: `四、我们如何保护您的个人信息`,
            className: 'title',
        },
        {
            text: `（一）我们非常重视用户的隐私和个人信息保护，也会采取合理的措施保护用户的个人信息。除法律法规规定或本政策另有约定的情形外，平台将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。未经用户许可我们不会向第三方公开、透露用户个人信息，并会对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。`,
        },
        {
            text: `（二）您理解并同意，在不透露单个用户隐私资料的前提下，平台有权对整个用户数据库进行技术分析，只有对进行分析、整理后达到匿名化后的用户数据方才进行商业上的利用。`,
        },
        {
            text: `（三）数据安全措施`,
        },
        {
            text: `1.平台会采用符合业界标准的安全防护措施，包括建立合理的制度规范、安全技术来防止您的个人信息遭到未经授权的访问使用、修改，避免数据的损坏或丢失。例如，平台的网络服务采取了传输层安全协议等加密技术，通过https等方式提供浏览服务，确保用户数据在传输过程中的安全；我们采取加密技术（TLS、SSL）、匿名化处理和保护机制对用户个人信息进行加密保存，并通过隔离技术进行隔离；我们通过建立数据分类分级制度、数据安全管理规范、数据安全开发规范来管理规范个人信息的存储和使用；我们通过信息接触者保密协议等方式，仅允许有必要知晓这些信息的平台及平台关联方的员工、合作伙伴访问个人信息，并为此设置了严格的访问权限控制和监控机制，同时要求接触到您个人信息的所有人员履行相应的保密义务。如果未能履行这些义务，会被追究法律责任或被中止与平台的合作关系；我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。`,
        },
        {
            text: `2.我们已经通过了公安部网络安全等级保护三级认证，同时还获得了ISO27001、ISO27701认证。`,
        },
        {
            text: `3.我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。`,
        },
        {
            text: `4.互联网并非绝对安全的环境，而且电子邮件、即时通讯及与其他用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的账号安全。`,
        },
        {
            text: `5.互联网环境并非百分之百安全，平台将尽力确保您发送给平台的任何信息的安全性。如果平台的物理、技术或管理防护设施遭到破坏，导致信息被非法授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。`,
        },
        {
            text: `6.在不幸发生个人信息安全事件后，平台将按照法律法规的要求，及时向您告知：安全事件发生的原因、可能造成的危害、涉及个人信息的种类、平台已采取或将要采取的处置措施、您可自主防范和降低风险的建议和可采取的措施等。平台将及时将事件相关情况以邮件、短信、电话、发送通知等任何一种方式告知您；难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，平台还将按照监管部门要求，主动上报个人信息安全事件的处置情况。请您知悉，根据可适用法律法规的规定，如采取措施能够有效避免信息泄露、篡改、丢失造成危害的，平台可以不向您进行告知。`,
        },
        {
            text: `五、我们如何存储您的个人信息`,
            className: 'title',
        },
        {
            text: `本产品与/或服务仅面向中国大陆地区（仅为本政策之目的，不包含香港特别行政区、澳门特别行政区和台湾地区）提供。原则上，我们在中华人民共和国境内收集产生的个人信息，存储在中华人民共和国境内，不会进行跨境传输。`,
        },
        {
            text: `（一）存储信息的地点`,
            className: 'header',
        },
        {
            text: `平台遵守法律法规的规定，收集的有关您的信息和资料将保存在中华人民共和国境内大陆地区平台的服务器上。以下情形除外：`,
        },
        {
            text: `•法律法规有明确规定；`,
        },
        {
            text: `•获得您的明确授权；`,
        },
        {
            text: `•您通过互联网进行跨境交易等个人主动行为。`,
        },
        {
            text: `（二）存储信息的期限`,
            className: 'header',
        },
        {
            text: `一般而言，我们将在您使用平台产品与/或服务期间为实现本政策所述目的所必需的最短时间保留您的个人信息，除非可适用的法律法规或国家规范性文件另有规定。`,
        },
        {
            text: `具体参考法律包括：`,
        },
        {
            text: `1.《中华人民共和国网络安全法》第三章第二十一条第（三）项规定：采取监测、记录网络运行状态、网络安全事件的技术措施，并按照规定留存相关的网络日志不少于六个月。`,
        },
        {
            text: `2.《中华人民共和国电子商务法》第二章第三十一条规定：电子商务平台经营者应当记录、保存平台上发布的商品和服务信息、交易信息，并确保信息的完整性、保密性、可用性；商品和服务信息、交易信息保存时间自交易完成之日起不少于三年；法律、行政法规另有规定的，依照其规定。`,
        },
        {
            text: `在超过上述期限，或您主动要求删除您的个人信息或注销您的账号后，我们将根据适用法律法规的要求尽快删除您的个人信息，除非可适用的法律法规或国家规范性文件要求在更长的期间内保留这些信息。但在下列情况下，平台因需符合法律要求，有权更改个人信息的存储时间：`,
        },
        {
            text: `•为遵守适用的法律法规等有关规定；`,
        },
        {
            text: `•为遵守法院判决、裁定或其他法律程序的规定；`,
        },
        {
            text: `•为遵守相关政府机关或法定授权组织的要求；`,
        },
        {
            text: `•平台有理由确信需要遵守法律法规等有关规定；`,
        },
        {
            text: `•为执行相关服务协议或本政策、维护社会公共利益，为保护平台的客户、平台、其他用户或雇员的人身财产安全或其他合法权益所合理必需的用途。`,
        },
        {
            text: `在您终止使用平台后，平台会停止对您的信息的收集和使用，法律法规或监管部门另有规定的除外。`,
        },
        {
            text: `当平台的相关服务发生停止运营的情形时，平台将采取包括发送通知或公告形式通知您，并在合理的期限内删除服务器中留存的您的个人信息。`,
        },
        {
            text: `六、您如何实现管理您个人信息的权利`,
            className: 'title',
        },
        {
            text: `按照中国相关的法律、法规、标准，您在个人信息处理活动中享有若干权利，具体包括：`,
        },
        {
            text: `•您对个人信息处理享有知情权、决定权，有权限制或者拒绝他人对您个人信息进行处理，法律、行政法规另有规定的除外；`,
        },
        {
            text: `•您有权向个人信息处理者查阅、复制您的个人信息，法律另有规定情形的除外；`,
        },
        {
            text: `•您有权请求将您的个人信息转移至您指定的个人信息处理者；`,
        },
        {
            text: `•您发现您的个人信息不准确或不完整的，有权请求个人信息处理者更正、补充；`,
        },
        {
            text: `•不再使用平台后，您有权请求删除您的个人信息，法律法规另有规定的除外；`,
        },
        {
            text: `•您有权要求个人信息处理者对其个人信息处理规则进行解释说明。`,
        },
        {
            text: `如果您无法查阅、补充、更正、删除、复制、转移您的个人信息，或改变您授权同意的范围或撤回授权、注销账号、限制自动化决策，或您需要查阅、补充、更正、删除、复制、转移您在使用平台时所产生的其他个人信息，或您认为我们存在任何违反法律法规或与您关于个人信息的收集或使用的约定，您可通过我们对外公布的相关产品或服务的官方反馈渠道与我们联系。`,
        },
        {
            text: `请您知悉，在以下情形中，我们将无法响应您的请求：`,
        },
        {
            text: `（1）与我们履行法律法规规定的义务相关的；`,
        },
        {
            text: `（2）与国家安全、国防安全直接相关的；`,
        },
        {
            text: `（3）与公共安全、公共卫生、公序良俗、重大公共利益直接相关的；`,
        },
        {
            text: `（4）与犯罪侦查、起诉、审判和执行判决等直接相关的；`,
        },
        {
            text: `（5）有证据表明您存在主观恶意或滥用权利的；`,
        },
        {
            text: `（6）出于保护您或其他个人的生命、财产等重大合法权益但又很难及时得到本人同意的；`,
        },
        {
            text: `（7）响应您的请求将可能导致您或其他个人、组织的合法权益受到严重损害的；`,
        },
        {
            text: `（8）涉及商业秘密或其他保密信息的。`,
        },
        {
            text: `当您是使用调用了平台人工智能API/SDK产品的最终用户时：`,
        },
        {
            text: `您可以通过本政策第九条列明的联系方式与我们联系。我们保证您对于自己的个人信息可进行本政策允许的查询、补充、更正或删除，或通过平台相关产品或服务发布的反馈或投诉渠道申请平台对相关信息进行补充、更正或删除；平台收到您的请求后将按规则流程予以处理。`,
        },
        {
            text: `七、我们如何保护未成年人的个人信息`,
            className: 'title',
        },
        {
            text: `（一）平台非常重视对未成年人个人信息的保护，我们将根据国家相关法律法规的规定保护未成年人的个人信息。`,
        },
        {
            text: `（二）我们将不满18周岁的任何人均视为未成年人。根据相关法律法规的规定，若您是年满14周岁的未成年人，我们在收集您的个人信息之前，会征得您或您的监护人的同意，并且当您、父母或者其他监护人要求我们更正、删除未成年人个人信息的，我们将及时采取措施予以更正、删除，但法律、行政法规另有规定的除外。`,
        },
        {
            text: `（三）若您是不满14周岁的未成年人（下称儿童），我们在收集您的个人信息之前，会征得您的父母或其他监护人的同意。`,
        },
        {
            text: `（四）我们在处理儿童个人信息时，将采取以下措施予以保障：对于收集到的儿童个人信息，我们除遵守本政策关于用户个人信息的约定外，还会秉持正当必要、知情同意、目的明确、安全保障、依法利用的原则，严格遵循《儿童个人信息网络保护规定》等法律法规的要求进行存储、使用、披露，且不会超过实现收集、使用目的所必须的期限，到期后我们会对儿童个人信息进行删除。具体地，请通过阅读《平台儿童隐私保护政策》以了解详情。`,
        },
        {
            text: `（五）若您是未成年人的父母或监护人，如您对本政策及《平台儿童隐私保护政策》中所述相关事宜有任何疑问、意见、建议或投诉、举报需求，请通过电话或电子邮件方式与我们进行反馈。`,
        },
        {
            text: `八、我们如何更新本政策`,
            className: 'title',
        },
        {
            text: `（一）为给您提供更好的服务，平台产品与/或服务将不时更新与变化，我们会适时对本政策进行修订，这些修订构成本政策的一部分。但是未经您明确同意，我们不会削减您按照本政策所应享有的权利。同时平台会将本政策的旧版本存档，供您查阅。`,
        },
        {
            text: `（二）对于重大变更，平台还会提供更为显著的通知，包括平台会通过网站公示的方式进行通知甚至向您提供弹窗提示。如果您不同意本政策，或对本政策修改、更新的内容有异议，您可以选择停止使用平台产品与/或服务或者注销平台账号。但请您知悉，您账号注销之前、停止使用本服务之前的行为和活动仍受本政策的约束。`,
        },
        {
            text: `本政策所指的重大变更包括但不限于：`,
        },
        {
            text: `平台的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；`,
        },
        {
            text: `平台在控制权等方面发生重大变化。如并购重组等引起的所有者变更等；`,
        },
        {
            text: `个人信息共享、转让或公开披露的主要对象发生变化；`,
        },
        {
            text: `您参与个人信息处理方面的权利及其行使方式发生重大变化；`,
        },
        {
            text: `平台负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；`,
        },
        {
            text: `个人信息安全影响评估报告表明存在高风险时；`,
        },
        {
            text: `伴随政策或法律发布实施，为响应国家政策或者法律规范，做出变更。`,
        },
        {
            text: `九、如何联系我们`,
            className: 'title',
        },
        {
            text: `为更好地保护您的个人信息，我们设立有专门的网络安全与个人信息保护部门。如您在使用平台的过程中对本隐私政策有任何疑问或建议，请通过以下联系方式与我们联系：`,
        },
        {
            text: `电话：0571-88885888`,
        },
        {
            text: `邮箱：wt@hzwotu.com`,
        },
        {
            text: `地址：杭州市西湖区教工路88号立元大厦16层`,
        },
        {
            text: `为保障我们高效处理您的问题并及时向您反馈，需要您提交身份证明、有效联系方式和书面请求及相关证据，我们会在验证您的身份后处理您的请求。一般情况下，我们将在十五个工作日内回复。`,
        },
        {
            text: `如果您对我们的回复不满意，特别是您认为我们的个人信息处理行为损害了且在您向我们反馈后我们无法提供让您满意的回复且拒绝改进的，您可以向相关监管机构进行投诉和举报。`,
        },
        {
            text: `十、其他`,
            className: 'title',
        },
        {
            text: `与本政策相关的任何纠纷，双方应经友好协商解决；若不能协商解决，您在此同意向平台所在地的互联网法院提起诉讼。`,
        },
        {
            text: `如果有管辖权的任何法院裁定或判决本政策的任何条款无效，则该条款将从本政策中移除，但该条款的无效不影响本政策其余条款的效力。本政策的其余条款将继续执行。`,
        },
    ]
}

//实名政策
export const realNamePolicy = (name: string) => {
    return [
        {
            text: `${name}个人实名认证服务协议`,
            className: 'name',
        },
        {
            text: `您确认，在使用${name}（以下简称“本平台”）相关产品或服务前，您已详细阅读了本协议相关内容，一旦您开始个人实名认证流程，即表示您充分理解并同意接受本协议的全部内容。`,
        },
        {
            text: `一、服务内容`,
            className: 'title',
        },
        {
            text: `本平台向您提供个人实名认证服务。个人实名认证服务指本平台用户签署了实名认证服务协议，采用身份证实名认证。经本平台核实有效后，给予用户个人实名认证标识的服务。完成实名认证的用户，方可使用本单位的产品/服务。`,
        },
        {
            text: `二、适用范围`,
            className: 'title',
        },
        {
            text: `实名认证服务适用于本平台的所有用户。`,
        },
        {
            text: `三、认证流程`,
            className: 'title',
        },
        {
            text: `（一）身份证实名认证：用户在实名认证申请页面填写常住地址，上传身份证照片。身份证照片要求为彩色、完整的原件(正面和反面)扫描或照片，能够清晰辨识证件图案和文字内容；本平台在收到认证申请后，返回通过或未通过认证的结果。`,
        },
        {
            text: `（二）通过实名认证的本平台用户不能自行修改已经认证的信息，包括但不限于个人姓名以及身份证件号码等。`,
        },
        {
            text: `四、隐私保护`,
            className: 'title',
        },
        {
            text: `（一）您在认证时提交给本平台的认证资料，即不可撤销的授权由本平台保留。本平台承诺除法定或约定的事由外，不公开或编辑或透露您的认证资料及保存在本平台的非公开内容用于商业目的，但下列情况除外：`,
        },
        {
            text: `1.您授权本平台透露的相关信息；`,
        },
        {
            text: `2.本平台向国家司法及行政等机关提供；`,
        },
        {
            text: `3.第三方和本平台一起为用户提供服务时，该第三方向您提供服务所需。`,
        },
        {
            text: `（二）我们将采取合理的方式以保护您个人资料的安全。我们将使用必要的可以获得的安全技术和程序来保护您的个人资料不被未经授权的访问、使用或泄漏。`,
        },
        {
            text: `五、免责条款`,
            className: 'title',
        },
        {
            text: `下列情况时本平台无需承担任何责任：`,
        },
        {
            text: `（一）由于您将本平台账户密码告知他人或未保管好自己的密码或与他人共享本平台账户或任何其他非本平台的过错，导致您的个人资料泄露。`,
        },
        {
            text: `（二）由于不可抗力，例如出现故障、火灾、水灾、雷击、地震、洪水、台风、龙卷风、火山爆发、瘟疫和传染病流行、罢工、战争或暴力行为或类似事件、政府行为等及其他非因本平台过错而造成的认证信息泄露、丢失、被盗用或被篡改等。`,
        },
        {
            text: `（三）本平台任何用户（包括未成年人用户）向本平台提供错误、不完整、不实信息等造成不能通过认证或遭受任何其他损失。`,
        },
        {
            text: `六、修改和解释权`,
            className: 'title',
        },
        {
            text: `（一）本平台有权单方随时修改或变更本协议内容，并通过本平台公告变更后的协议文本，无需单独通知您。本协议进行任何修改或变更后，您还继续使用实名认证服务的，即代表您已阅读、了解并同意接受变更后的协议内容，且不得因此而要求任何补偿或赔偿；您如果不同意变更后的协议内容，可停止使用我们所提供的服务。`,
        },
        {
            text: `（二）我们保留对本协议条款、产品和服务以及我们所提供的产品和服务的相关官方网站的最终解释权。`,
        },
    ]
}
